modules/samples/microprofile/microprofile-jwt/src/main/resources/configs/oauth-app-registration.xml

<!--
  ~ Copyright (c) 2018, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
  ~
  ~ WSO2 Inc. licenses this file to you under the Apache License,
  ~ Version 2.0 (the "License"); you may not use this file except
  ~ in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd"
                  xmlns:xsd1="http://dto.oauth.identity.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <xsd:registerOAuthApplicationData>
            <!--Optional:-->
            <xsd:application>
                <!--Optional:-->
                <xsd1:OAuthVersion>OAuth-2.0</xsd1:OAuthVersion>
                <!--Optional:-->
                <xsd1:applicationName>microprofile_jwt_sample</xsd1:applicationName>
                <!--Optional:-->
                <xsd1:callbackUrl>http://localhost:9443/</xsd1:callbackUrl>
                <!--Optional:-->
                <xsd1:grantTypes>refresh_token urn:ietf:params:oauth:grant-type:saml2-bearer implicit password iwa:ntlm
                    client_credentials authorization_code
                </xsd1:grantTypes>
                <!--Optional:-->
                <xsd1:oauthConsumerKey>li6JMbjW6WDMKTWsRnGcjp5zcGhi</xsd1:oauthConsumerKey>
                <!--Optional:-->
                <xsd1:oauthConsumerSecret>NMB3EAfxh4YvSTqbb3iMkongAHjW</xsd1:oauthConsumerSecret>
                <!--Optional:-->
                <xsd1:pkceMandatory>false</xsd1:pkceMandatory>
                <!--Optional:-->
                <xsd1:pkceSupportPlain>true</xsd1:pkceSupportPlain>
                <!--Optional:-->
                <xsd1:state></xsd1:state>
                <!--Optional:-->
                <xsd1:username></xsd1:username>
            </xsd:application>
        </xsd:registerOAuthApplicationData>
    </soapenv:Body>
</soapenv:Envelope>
